bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_apwm.c
    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_PPL, polP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_NPL, polN);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_PPL, polP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_NPL, polN);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_PPL, polP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_NPL, polN);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_PPL, polP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_NPL, polN);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}
void APWM_CC_ChannelP_Set_Polarity(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Polarity_Type pol)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_POLARITY_TYPE(pol));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_PPL, pol);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_PPL, pol);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_PPL, pol);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_PPL, pol);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}
void APWM_CC_ChannelN_Set_Polarity(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Polarity_Type pol)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_POLARITY_TYPE(pol));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_NPL, pol);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_NPL, pol);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_NPL, pol);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_NPL, pol);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}
void APWM_CC_Channel_Set_Idle_State(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Idle_State_Type idlP, APWM_Idle_State_Type idlN)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_IDLE_STATE_TYPE(idlP));
    CHECK_PARAM(IS_APWM_IDLE_STATE_TYPE(idlN));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_PSI, idlP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_NSI, idlN);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_PSI, idlP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_NSI, idlN);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_PSI, idlP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_NSI, idlN);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_PSI, idlP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_NSI, idlN);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}
void APWM_CC_ChannelP_Set_Idle_State(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Idle_State_Type idl)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_IDLE_STATE_TYPE(idl));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_PSI, idl);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_PSI, idl);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_PSI, idl);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_PSI, idl);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}
void APWM_CC_ChannelN_Set_Idle_State(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Idle_State_Type idl)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_IDLE_STATE_TYPE(idl));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_NSI, idl);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_NSI, idl);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_NSI, idl);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_NSI, idl);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}

void APWM_CC_Channel_Set_Break_State(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Break_State_Type brkP, APWM_Break_State_Type brkN)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_BREAK_STATE_TYPE(brkP));
    CHECK_PARAM(IS_APWM_BREAK_STATE_TYPE(brkN));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_PBS, brkP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_NBS, brkN);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_PBS, brkP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_NBS, brkN);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_PBS, brkP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_NBS, brkN);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_PBS, brkP);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_NBS, brkN);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}
void APWM_CC_ChannelP_Set_Break_State(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Break_State_Type brk)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_BREAK_STATE_TYPE(brk));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_PBS, brk);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_PBS, brk);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_PBS, brk);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_PBS, brk);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}
void APWM_CC_ChannelN_Set_Break_State(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, APWM_Break_State_Type brk)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));
    CHECK_PARAM(IS_APWM_BREAK_STATE_TYPE(brk));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG1);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_NBS, brk);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_NBS, brk);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_NBS, brk);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_NBS, brk);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_CONFIG1, tmpVal);
}

void APWM_CC_Channel_Update_Config1(APWM_CH_ID_Type ch, uint32_t cfg)
{
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));

    /* Config pwm config1 */
    BL_WR_REG(APWMx, APWM_CONFIG1, cfg);
}
void APWM_CC_Channel_Get_Config1(APWM_CH_ID_Type ch, uint32_t *cfg)
{
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));

    /* Get pwm config1 value */
    *cfg = BL_RD_REG(APWMx, APWM_CONFIG1);
}
void APWM_CC_Channel_Set_Dtg(APWM_CH_ID_Type ch, APWM_CC_CH_ID_Type cc, uint8_t dtg)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_CC_CH_ID_TYPE(cc));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(APWMx, APWM_DEAD_TIME);
    switch (cc)
    {
    case APWM_CC_CH0:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH0_DTG, dtg);
        break;
    case APWM_CC_CH1:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH1_DTG, dtg);
        break;
    case APWM_CC_CH2:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH2_DTG, dtg);
        break;
    case APWM_CC_CH3:
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_CH3_DTG, dtg);
        break;
    default:
        break;
    }
    BL_WR_REG(APWMx, APWM_DEAD_TIME, tmpVal);
}
void APWM_SW_Break_Enable(APWM_CH_ID_Type ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG0);
    tmpVal = BL_SET_REG_BIT(tmpVal, APWM_SW_BREAK_EN);
    BL_WR_REG(APWMx, APWM_CONFIG0, tmpVal);
}
void APWM_SW_Break_Disable(APWM_CH_ID_Type ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, APWM_SW_BREAK_EN);
    BL_WR_REG(APWMx, APWM_CONFIG0, tmpVal);
}
void APWM_EXT_Break_Enable(APWM_CH_ID_Type ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG0);
    tmpVal = BL_SET_REG_BIT(tmpVal, APWM_EXT_BREAK_EN);
    BL_WR_REG(APWMx, APWM_CONFIG0, tmpVal);
}
void APWM_EXT_Break_Disable(APWM_CH_ID_Type ch)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, APWM_EXT_BREAK_EN);
    BL_WR_REG(APWMx, APWM_CONFIG0, tmpVal);
}
void APWM_EXT_Break_Set_Polarity(APWM_CH_ID_Type ch, APWM_EXT_Break_Polarity_Type pol)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_EXT_BREAK_POLARITY_TYPE(pol));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_EXT_BREAK_PL, pol);
    BL_WR_REG(APWMx, APWM_CONFIG0, tmpVal);
}

void APWM_Set_TrigADC_Source(APWM_CH_ID_Type ch, APWM_TrigADC_Source_Type src)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_TRIGADC_SOURCE_TYPE(src));

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(APWMx, APWM_CONFIG0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, APWM_ADC_TRG_SRC, src);
    BL_WR_REG(APWMx, APWM_CONFIG0, tmpVal);
}

/****************************************************************************//**
 * @brief  Mask/Unmask the PWM interrupt
 *
 * @param  ch: PWM channel number
 * @param  intType: Specifies the interrupt type
 * @param  intMask: Enable/Disable Specified interrupt type
 *
 * @return None
 *
*******************************************************************************/
void APWM_Int_Mask(APWM_CH_ID_Type ch,APWM_INT_Type intType,BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_INT_TYPE(intType));

    tmpVal = BL_RD_REG(APWMx, APWM_INT_MASK);
    if(intType == APWM_INT_ALL){
        if(intMask == UNMASK){
            tmpVal &= ~((1U << APWM_INT_ALL) - 1);
        }
        else{
            tmpVal |= ((1U << APWM_INT_ALL) - 1);
        }
    }
    else{
        if (intMask == UNMASK)
        {
            tmpVal &= ~(1U << intType);
        }
        else
        {
            tmpVal |= (1U << intType);
        }
    }
    BL_WR_REG(APWMx, APWM_INT_MASK, tmpVal);
}

void APWM_Int_Clear(APWM_CH_ID_Type ch, APWM_INT_Type intType)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_INT_TYPE(intType));

