bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_apwm.c
    tmpVal = BL_RD_REG(APWMx, APWM_INT_CLEAR);

    if (intType == APWM_INT_ALL)
    {
        tmpVal = ((1U << APWM_INT_ALL) - 1);
    }
    else
    {
        tmpVal = (1U << intType);
    }
    BL_WR_REG(APWMx, APWM_INT_CLEAR, tmpVal);
}

BL_Sts_Type APWM_Get_Int_Status(APWM_CH_ID_Type ch, APWM_INT_Type intType)
{
    uint32_t tmpVal;
    /* Get channel register */
    uint32_t APWMx = APWM_Get_Channel_Reg(ch);

    /* Check the parameters */
    CHECK_PARAM(IS_APWM_CH_ID_TYPE(ch));
    CHECK_PARAM(IS_APWM_INT_TYPE(intType));

    tmpVal = BL_RD_REG(APWMx, APWM_INT_STS);

    if (intType == APWM_INT_ALL)
    {
        if(tmpVal & ((1<<APWM_CC_CH_MAX)-1))
        {
            return SET;
        }
        else
        {
            return RESET;
        }
    }
    else
    {
        if (tmpVal & (1 << intType))
        {
            return SET;
        }
        else
        {
            return RESET;
        }
    }
}

/****************************************************************************//**
 * @brief  Install PWM interrupt callback function
 *
 * @param  ch: PWM channel number
 * @param  intType: PWM interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void APWM_Int_Callback_Install(APWM_CH_ID_Type ch, uint32_t intType, intCallback_Type *cbFun)
{
    APWMIntCbfArra[ch][intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  PWM interrupt function
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void APWM_IRQHandler(void)
{
    APWM_IntHandler(APWM_IRQn);
}
#endif

/*@} end of group APWM_Public_Functions */

/*@} end of group APWM */

/*@} end of group BL808_Peripheral_Driver */
